app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT * FROM "products"

  def show
    @title = "SHOW"
    @product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 17)

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES('computer', 2000.0, '2010-07-21 13:47:29', '2010-07-21 13:47:29')

  def update
    @product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 17)

  def delete_photo
    @photo =  Photo.find(params[:id])
    @photo.destroy
---
SELECT * FROM "photos" WHERE ("photos"."id" = 1)
DELETE FROM "photos" WHERE "id" = 1